{
  "attention_probs_dropout_prob": 0.1,
  "cross_attention_frequency": 1,
  "encoder_hidden_size": 768,
  "text_encoder_hidden_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "QFormer",
  "num_attention_heads": 8,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.44.2",
  "use_qformer_text_input": false,
  "vocab_size": 30522
}
